espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/price-server/price-server-cli.c
/***************************************************************************//**
 * @file
 * @brief CLI for the Price Server plugin.
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#include "app/framework/include/af.h"
#include "app/util/serial/sl_zigbee_command_interpreter.h"
#include "price-server.h"
#ifdef UC_BUILD
#include "zigbee_af_cluster_functions.h"
#endif  // UC_BUILD

//=============================================================================
// Globals

static EmberAfScheduledPrice price;

//=============================================================================
// Functions
#ifndef UC_BUILD
void emAfPriceServerCliClear(void);
void emAfPriceServerCliInit(void);
void emAfPriceServerCliTClear(void);
void emAfPriceServerCliWho(void);
void emAfPriceServerCliTWho(void);
void emAfPriceServerCliWhat(void);
void emAfPriceServerCliTWhat(void);
void emAfPriceServerCliWhen(void);
void emAfPriceServerCliTWhen(void);
void emAfPriceServerCliPrice(void);
void emAfPriceServerCliTariff(void);
void emAfPriceServerCliAlternate(void);
void emAfPriceServerCliAck(void);
void emAfPriceServerCliValid(void);
void emAfPriceServerCliTAdd(void);
void emAfPriceServerCliGet(void);
void emAfPriceServerCliTGet(void);
void emAfPriceServerCliPrint(void);
void emAfPriceServerCliTPrint(void);
void emAfPriceServerCliSprint(void);
void emAfPriceServerCliTSPrint(void);
void emAfPriceServerCliPublish(void);
void emAfPriceServerCliPmPrint(void);
void emAfPriceServerCliPmSetMetadata(void);
void emAfPriceServerCliPmSetProvider(void);
void emAfPriceServerCliPmSetEvent(void);
void emAfPriceServerCliPmSetTariff(void);
void emAfPriceServerCliPmSetTime(void);
void emAfPriceServerCliPmSetStatus(void);
void emAfPriceServerCliPmGet(void);
void emAfPriceServerCliPmAdd(void);
void emAfPriceServerCliPmPut(void);
void emAfPriceServerCliPmFillTier(void);
void emAfPriceServerCliPmFillBlock(void);
void emAfPriceServerCliBlockPeriodAdd(void);
void emAfPriceServerCliBlockPeriodPrint(void);
void emAfPriceServerCliBlockPeriodPub(void);
void emAfPriceServerCliConversionFactor(void);
void emAfPriceServerCliCppEventSet(void);
void emAfPriceServerCliCppEventPub(void);
void emAfPriceServerCliCppEventPrint(void);
void emAfPriceServerCliCreditPaymentPub(void);
void emAfPriceServerCliCreditPaymentSet(void);
void emAfPriceServerCliCreditPaymentPrint(void);
void emAfPriceServerCliCurrencyConversionPub(void);
void emAfPriceServerCliCurrencyConversionSet(void);

//=============================================================================
// Globals

#if !defined(EMBER_AF_GENERATE_CLI)
EmberCommandEntry emberAfPluginPriceServerCommands[] = {
  emberCommandEntryAction("clear", emAfPriceServerCliClear, "u", ""),
  emberCommandEntryAction("who", emAfPriceServerCliWho, "wbw", ""),
  emberCommandEntryAction("what", emAfPriceServerCliWhat, "uvuuu", ""),
  emberCommandEntryAction("when", emAfPriceServerCliWhen, "wv", ""),
  emberCommandEntryAction("price", emAfPriceServerCliPrice, "wuwu", ""),
  emberCommandEntryAction("alternate", emAfPriceServerCliAlternate, "wuu", ""),
  emberCommandEntryAction("ack", emAfPriceServerCliAck, "u", ""),
  emberCommandEntryAction("valid", emAfPriceServerCliValid, "uu", ""),
  emberCommandEntryAction("get", emAfPriceServerCliGet, "uu", ""),
  emberCommandEntryAction("print", emAfPriceServerCliPrint, "u", ""),
  emberCommandEntryAction("sprint", emAfPriceServerCliSprint, "u", ""),
  emberCommandEntryAction("publish", emAfPriceServerCliPublish, "vuuu", ""),
  emberCommandEntryTerminator(),
};
#endif // EMBER_AF_GENERATE_CLI

//=============================================================================

// plugin price-server init <endpoint:1>
void emAfPriceServerCliInit(void)
{
  emberAfPriceClusterServerInitCallback((uint8_t)emberUnsignedCommandArgument(0));
}

// plugin price-server clear <endpoint:1>
void emAfPriceServerCliClear(void)
{
  emberAfPriceClearPriceTable((uint8_t)emberUnsignedCommandArgument(0));
}

// plugin price-server who <provId:4> <label:1-13> <eventId:4>
void emAfPriceServerCliWho(void)
{
  uint8_t length;
  price.providerId = emberUnsignedCommandArgument(0);
  length = emberCopyStringArgument(1,
                                   price.rateLabel + 1,
                                   ZCL_PRICE_CLUSTER_MAXIMUM_RATE_LABEL_LENGTH,
                                   false);
  price.rateLabel[0] = length;
  price.issuerEventID = emberUnsignedCommandArgument(2);
}

// plugin price-server what <unitOfMeas:1> <curr:2> <ptd:1> <PTRT:1> <bt:1>
void emAfPriceServerCliWhat(void)
{
  price.unitOfMeasure = (uint8_t)emberUnsignedCommandArgument(0);
  price.currency = (uint16_t)emberUnsignedCommandArgument(1);
  price.priceTrailingDigitAndTier = (uint8_t)emberUnsignedCommandArgument(2);
  price.numberOfPriceTiersAndTier = (uint8_t)emberUnsignedCommandArgument(3);
  price.numberOfBlockThresholds = (uint8_t)emberUnsignedCommandArgument(4);
}

// plugin price-server when <startTime:4> <duration:2>
void emAfPriceServerCliWhen(void)
{
  price.startTime = emberUnsignedCommandArgument(0);
  price.duration = (uint16_t)emberUnsignedCommandArgument(1);
}

// plugin price-server price <price:4> <ratio:1> <genPrice:4> <genRatio:1>
void emAfPriceServerCliPrice(void)
{
  price.price = emberUnsignedCommandArgument(0);
  price.priceRatio = (uint8_t)emberUnsignedCommandArgument(1);
  price.generationPrice = emberUnsignedCommandArgument(2);
  price.generationPriceRatio = (uint8_t)emberUnsignedCommandArgument(3);
}

// plugin price-server alternate <alternateCostDelivered:4> <alternateCostUnit:1> <alternateCostTrailingDigit:1>
void emAfPriceServerCliAlternate(void)
{
  price.alternateCostDelivered = emberUnsignedCommandArgument(0);
  price.alternateCostUnit = (uint8_t)emberUnsignedCommandArgument(1);
  price.alternateCostTrailingDigit = (uint8_t)emberUnsignedCommandArgument(2);
}

// plugin price-server ack <req:1>
void emAfPriceServerCliAck(void)
{
  price.priceControl &= ~ZCL_PRICE_CLUSTER_PRICE_ACKNOWLEDGEMENT_MASK;
  if ( ((uint8_t)emberUnsignedCommandArgument(0)) == 1u) {
    price.priceControl |= EMBER_ZCL_PRICE_CONTROL_ACKNOWLEDGEMENT_REQUIRED;
  }
}

// plugin price-server <valid | invalid | tinvalid> <endpoint:1> <index:1>
void emAfPriceServerCliValid(void)
{
  uint8_t endpoint = (uint8_t)emberUnsignedCommandArgument(0);
  uint8_t index = (uint8_t)emberUnsignedCommandArgument(1);
  if (emberCurrentCommand->name[0] == 't') {
    if (!emberAfPriceSetTariffTableEntry(endpoint,
                                         index,
                                         NULL,
                                         NULL)) {
      emberAfPriceClusterPrintln("tariff entry %d not present", index);
    }

    return;
  }

