espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/price-server/price-server-cli.c
  if (!emberAfPriceSetPriceTableEntry(endpoint,
                                      index,
                                      (emberCurrentCommand->name[0] == 'v'
                                       ? &price
                                       : NULL))) {
    emberAfPriceClusterPrintln("price entry %d not present", index);
  }
}

// plugin price-server get <endpoint:1> <index:1>
void emAfPriceServerCliGet(void)
{
  uint8_t endpoint = (uint8_t)emberUnsignedCommandArgument(0);
  uint8_t index = (uint8_t)emberUnsignedCommandArgument(1);
  if (!emberAfPriceGetPriceTableEntry(endpoint, index, &price)) {
    emberAfPriceClusterPrintln("price entry %d not present", index);
  }
}

// plugin price-server print <endpoint:1>
void emAfPriceServerCliPrint(void)
{
  uint8_t endpoint = (uint8_t)emberUnsignedCommandArgument(0);
  emberAfPricePrintPriceTable(endpoint);
}

// plugin price-server sprint
void emAfPriceServerCliSprint(void)
{
  emberAfPricePrint(&price);
}

// plugin price-server publish <nodeId:2> <srcEndpoint:1> <dstEndpoint:1> <priceIndex:1>
void emAfPriceServerCliPublish(void)
{
  emberAfPluginPriceServerPublishPriceMessage((EmberNodeId)emberUnsignedCommandArgument(0),
                                              (uint8_t)emberUnsignedCommandArgument(1),
                                              (uint8_t)emberUnsignedCommandArgument(2),
                                              (uint8_t)emberUnsignedCommandArgument(3));
}

// plugin price-server pub-tariff-info <nodeId:2> <srcEndpoint:1> <dstEndpoint:1> <tariffIndex:1>
void emAfPriceServerCliPubTariffInfo(void)
{
  emberAfPluginPriceServerPublishTariffMessage((EmberNodeId)emberUnsignedCommandArgument(0),
                                               (uint8_t)emberUnsignedCommandArgument(1),
                                               (uint8_t)emberUnsignedCommandArgument(2),
                                               (uint8_t)emberUnsignedCommandArgument(3));
}

// plugin price-server block-period add <endpoint:1> <providerId:4> <issuerEventId:4> <blockPeriodStartTime:4> <blockPeriodDuration:4> <blockPeriodControl:1> <blockPeriodDurationType:1> <tariffType:1> <tariffResolutionPeriod:1>
void emAfPriceServerCliBlockPeriodAdd(void)
{
  emberAfPluginPriceServerBlockPeriodAdd( (uint8_t) emberUnsignedCommandArgument(0),
                                          (uint32_t)emberUnsignedCommandArgument(1),
                                          (uint32_t)emberUnsignedCommandArgument(2),
                                          (uint32_t)emberUnsignedCommandArgument(3),
                                          (uint32_t)emberUnsignedCommandArgument(4),
                                          (uint8_t) emberUnsignedCommandArgument(5),
                                          (uint8_t) emberUnsignedCommandArgument(6),
                                          (uint32_t)emberUnsignedCommandArgument(7),
                                          (uint32_t)emberUnsignedCommandArgument(8),
                                          (uint8_t) emberUnsignedCommandArgument(9),
                                          (uint8_t)emberUnsignedCommandArgument(10) );
}

// plugin price-server block-period print <endpoint:1> <index:1>
void emAfPriceServerCliBlockPeriodPrint(void)
{
  emberAfPluginPriceServerBlockPeriodPrint( (uint8_t)emberUnsignedCommandArgument(0),
                                            (uint8_t)emberUnsignedCommandArgument(1) );
}

// plugin price-server block-period pub <nodeId:2> <srcEndpoint:1> <dstEndpoint:1> <index:1>
void emAfPriceServerCliBlockPeriodPub(void)
{
  emberAfPluginPriceServerBlockPeriodPub( (uint16_t)emberUnsignedCommandArgument(0),
                                          (uint8_t)emberUnsignedCommandArgument(1),
                                          (uint8_t)emberUnsignedCommandArgument(2),
                                          (uint8_t)emberUnsignedCommandArgument(3) );
}

// plugin price-server block-period clear <endpoint:1>
void emAfPriceServerCliBlockPeriodClear(void)
{
  emberAfPriceClearBlockPeriodTable((uint8_t)emberUnsignedCommandArgument(0));
}

// plugin price-server conversion-factor add <endpoint:1> <issuerEventId:4> <startTime:4> <conversionFactor:4> <conversionFactorTrailingDigit:1>
void emAfPriceServerCliConversionFactorAdd(void)
{
  (void) emberAfPluginPriceServerConversionFactorAdd((uint8_t) emberUnsignedCommandArgument(0),
                                                     (uint32_t)emberUnsignedCommandArgument(1),
                                                     (uint32_t)emberUnsignedCommandArgument(2),
                                                     (uint32_t)emberUnsignedCommandArgument(3),
                                                     (uint8_t) emberUnsignedCommandArgument(4) );
}

// plugin price-server conversion-factor clear <endpoint:1>
void emAfPriceServerCliConversionFactorClear(void)
{
  emberAfPluginPriceServerConversionFactorClear( (uint8_t)emberUnsignedCommandArgument(0) );
}

// plugin price-server conversion-factor pub <tableIndex:1>  <dst:2> <src endpoint:1>  <dst endpoint:1>
void emAfPriceServerCliConversionFactorPub(void)
{
  uint8_t tableIndex = (uint8_t)emberUnsignedCommandArgument(0);
  EmberNodeId dstAddr = (EmberNodeId)emberUnsignedCommandArgument(1);
  uint8_t srcEndpoint =  (uint8_t)emberUnsignedCommandArgument(2);
  uint8_t dstEndpoint =  (uint8_t)emberUnsignedCommandArgument(3);
  emberAfPluginPriceServerConversionFactorPub(tableIndex, dstAddr, srcEndpoint, dstEndpoint);
}

// plugin price-server conversion-factor print <endpoint:1>
void emAfPriceServerCliConversionFactorPrint(void)
{
  emberAfPrintConversionTable( (uint8_t)emberUnsignedCommandArgument(0) );
}

// plugin price-server calorific-value add <endpoint:1> <issuerEventId:4> <startTime:4> <calorificValue:4> <calorificValueUnit:1> <calorificValueTrailingDigit:1>
void emAfPriceServerCliCalorificValueAdd(void)
{
  (void) emberAfPluginPriceServerCalorificValueAdd((uint8_t) emberUnsignedCommandArgument(0),
                                                   (uint32_t)emberUnsignedCommandArgument(1),
                                                   (uint32_t)emberUnsignedCommandArgument(2),
                                                   (uint32_t)emberUnsignedCommandArgument(3),
                                                   (uint8_t) emberUnsignedCommandArgument(4),
                                                   (uint8_t) emberUnsignedCommandArgument(5));
}

// plugin price-server calorific-factor clear <endpoint:1>
void emAfPriceServerCliCalorificValueClear(void)
{
  emberAfPluginPriceServerCalorificValueClear( (uint8_t)emberUnsignedCommandArgument(0) );
}

