espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/price-server/price-server-cli.c
// plugin price-server calorific-factor print <endpoint:1>
void emAfPriceServerCliCalorificValuePrint(void)
{
  emberAfPrintCalorificValuesTable( (uint8_t)emberUnsignedCommandArgument(0) );
}

// plugin price-server co2-val add <endpoint:1> <issuerEventId:4> <startTime:4> <providerId:4> <tariffType:1> <co2Value:4> <co2ValueUnit:1> <co2ValueTrailingDigit:1>
void emAfPriceServerCliCo2ValueAdd(void)
{
  emberAfPluginPriceServerCo2ValueAdd((uint8_t) emberUnsignedCommandArgument(0),
                                      (uint32_t)emberUnsignedCommandArgument(1),
                                      (uint32_t)emberUnsignedCommandArgument(2),
                                      (uint32_t)emberUnsignedCommandArgument(3),
                                      (uint8_t) emberUnsignedCommandArgument(4),
                                      (uint32_t)emberUnsignedCommandArgument(5),
                                      (uint8_t) emberUnsignedCommandArgument(6),
                                      (uint8_t) emberUnsignedCommandArgument(7));
}

// plugin price-server co2-val clear <endpoint:1>
void emAfPriceServerCliCo2ValueClear(void)
{
  emberAfPluginPriceServerCo2ValueClear( (uint8_t)emberUnsignedCommandArgument(0) );
}

// plugin price-server co2-val print <endpoint:1>
void emAfPriceServerCliCo2ValuePrint(void)
{
  emberAfPrintCo2ValuesTable( (uint8_t)emberUnsignedCommandArgument(0) );
}

// plugin price-server tier-label set
void emAfPriceServerCliTierLabelSet(void)
{
  uint8_t len;
  uint8_t tierLabel[13];
  len = emberCopyStringArgument(7, tierLabel + 1, 12, false);

  tierLabel[0] = len;
  emberAfPluginPriceServerTierLabelSet((uint8_t) emberUnsignedCommandArgument(0),
                                       (uint8_t) emberUnsignedCommandArgument(1),
                                       (uint8_t) emberUnsignedCommandArgument(2),
                                       (uint32_t)emberUnsignedCommandArgument(3),
                                       (uint32_t)emberUnsignedCommandArgument(4),
                                       (uint32_t)emberUnsignedCommandArgument(5),
                                       (uint8_t) emberUnsignedCommandArgument(6),
                                       tierLabel);
}

// plugin price-server tier-label add-label
void emAfPriceServerCliTierLabelAddLabel(void)
{
  uint8_t len;
  uint8_t tierLabel[13];
  uint32_t tariffId;
  len = emberCopyStringArgument(3, tierLabel + 1, 12, false);
  tierLabel[0] = len;

  tariffId = (uint32_t)emberUnsignedCommandArgument(1);
  emberAfPluginPriceServerTierLabelAddLabel( (uint8_t)emberUnsignedCommandArgument(0),
                                             tariffId,
                                             (uint8_t)emberUnsignedCommandArgument(2),
                                             tierLabel);
}

// plugin price-server tier-label print <endpoint:1>
void emAfPriceServerCliTierLabelPrint(void)
{
  emberAfPrintTierLabelsTable( (uint8_t)emberUnsignedCommandArgument(0) );
}

// plugin price-server tier-label pub  <nodeId:2> <srcEndpoint:1> <dstEndpoint:1> <tableIndex:1>
void emAfPriceServerCliTierLabelPub(void)
{
  emberAfPluginPriceServerTierLabelPub((uint16_t)emberUnsignedCommandArgument(0),
                                       (uint8_t)emberUnsignedCommandArgument(1),
                                       (uint8_t)emberUnsignedCommandArgument(2),
                                       (uint8_t)emberUnsignedCommandArgument(3));
}

// plugin price-server co2-val pub <nodeId:2> <srcEndpoint:1> <dstEndpoint:1> <tableIndex:1>
void emAfPriceServerCliCo2ValuePub(void)
{
  emberAfPluginPriceServerCo2LabelPub((uint16_t)emberUnsignedCommandArgument(0),
                                      (uint8_t)emberUnsignedCommandArgument(1),
                                      (uint8_t)emberUnsignedCommandArgument(2),
                                      (uint8_t)emberUnsignedCommandArgument(3));
}

// plugin price-server billing-period add <endpoint:1> <startTime:4>
//                                        <issuerEventId:4> <providerId:4>
//                                        <providerId:4> <billingPeriodDuration:4>
//                                        <billingPeriodDuration:1> <tariffType:1>
void emAfPriceServerCliBillingPeriodAdd(void)
{
  (void) emberAfPluginPriceServerBillingPeriodAdd((uint8_t) emberUnsignedCommandArgument(0),
                                                  (uint32_t)emberUnsignedCommandArgument(1),
                                                  (uint32_t)emberUnsignedCommandArgument(2),
                                                  (uint32_t)emberUnsignedCommandArgument(3),
                                                  (uint32_t)emberUnsignedCommandArgument(4),
                                                  (uint8_t) emberUnsignedCommandArgument(5),
                                                  (uint8_t) emberUnsignedCommandArgument(6));
}

// plugin price-server billing-period print <endpoint:1>
void emAfPriceServerCliBillingPeriodPrint(void)
{
  emberAfPrintBillingPeriodTable( (uint8_t) emberUnsignedCommandArgument(0) );
}

// plugin price-server billing-period pub
void emAfPriceServerCliBillingPeriodPub(void)
{
  emberAfPluginPriceServerBillingPeriodPub((uint16_t)emberUnsignedCommandArgument(0),
                                           (uint8_t)emberUnsignedCommandArgument(1),
                                           (uint8_t)emberUnsignedCommandArgument(2),
                                           (uint8_t)emberUnsignedCommandArgument(3));
}

void emAfPriceServerCliBillingPeriodRepeat(void)
{
  emAfPluginPriceServerBillingPeriodRepeat = (bool)emberUnsignedCommandArgument(0);
}

// plugin price-server consol-bill add  <endpoint:1> <startTime:4>
//                                      <issuerEventId:4> <providerId:4>
//                                      <billingPeriodDuration:4> <billingPeriodDurationType:1>
//                                      <tariffType:1> <consolidatedBill:4>
//                                      <currency:2> <billTrailingDigit:1>
void emAfPriceServerCliConsolidatedBillAdd(void)
{
  emberAfPluginPriceServerConsolidatedBillAdd((uint8_t) emberUnsignedCommandArgument(0),
                                              (uint32_t)emberUnsignedCommandArgument(1),
                                              (uint32_t)emberUnsignedCommandArgument(2),
                                              (uint32_t)emberUnsignedCommandArgument(3),
                                              (uint32_t)emberUnsignedCommandArgument(4),
                                              (uint8_t) emberUnsignedCommandArgument(5),
                                              (uint8_t) emberUnsignedCommandArgument(6),
                                              (uint32_t)emberUnsignedCommandArgument(7),
                                              (uint16_t)emberUnsignedCommandArgument(8),
                                              (uint8_t) emberUnsignedCommandArgument(9) );
}

// plugin price-server consol-bill print <endpoint:1> <index:1>
void emAfPriceServerCliConsolidatedBillPrint(void)
{
  emberAfPrintConsolidatedBillTableEntry( (uint8_t)emberUnsignedCommandArgument(0),
                                          (uint8_t)emberUnsignedCommandArgument(1) );
}

// plugin price-server consol-bill pub  <nodeId:2> <srcEp:1> <dstEp:1> <index:1>
void emAfPriceServerCliConsolidatedBillPub(void)
{
  emberAfPluginPriceServerConsolidatedBillPub( (uint16_t)emberUnsignedCommandArgument(0),
                                               (uint8_t)emberUnsignedCommandArgument(1),
                                               (uint8_t)emberUnsignedCommandArgument(2),
                                               (uint8_t)emberUnsignedCommandArgument(3) );
}

// plugin price-server cpp-event set <endpoint:1> <valid:1> <providerId:4> <issuerEventId:4> <startTime:4>
//                                  <durationInMins:2> <tariffType:1> <cppPriceTier:1> <cppAuth:1>
void emAfPriceServerCliCppEventSet(void)
{
  emberAfPluginPriceServerCppEventSet( (uint8_t) emberUnsignedCommandArgument(0),
                                       (uint8_t) emberUnsignedCommandArgument(1),
                                       (uint32_t)emberUnsignedCommandArgument(2),
                                       (uint32_t)emberUnsignedCommandArgument(3),
                                       (uint32_t)emberUnsignedCommandArgument(4),
                                       (uint16_t)emberUnsignedCommandArgument(5),
                                       (uint8_t) emberUnsignedCommandArgument(6),
                                       (uint8_t) emberUnsignedCommandArgument(7),
                                       (uint8_t) emberUnsignedCommandArgument(8));
}

// plugin price-server cpp-event pub <nodeId:2> <srcEndpoint:1> <dstEndpoint:1>
void emAfPriceServerCliCppEventPub(void)
{
  emberAfPluginPriceServerCppEventPub( (uint16_t)emberUnsignedCommandArgument(0),
                                       (uint8_t )emberUnsignedCommandArgument(1),
                                       (uint8_t )emberUnsignedCommandArgument(2) );
}

// plugin price-server cpp-event print <endpoint:1>
void emAfPriceServerCliCppEventPrint(void)
{
  emberAfPluginPriceServerCppEventPrint( (uint8_t)emberUnsignedCommandArgument(0) );
}

// plugin price-server credit-pmt pub <nodeId:2> <srcEndpoint:1> <dstEndpoint:1> <index:1>
void emAfPriceServerCliCreditPaymentPub(void)
{
  emberAfPluginPriceServerCreditPaymentPub( (uint16_t)emberUnsignedCommandArgument(0),
                                            (uint8_t )emberUnsignedCommandArgument(1),
                                            (uint8_t )emberUnsignedCommandArgument(2),
                                            (uint8_t )emberUnsignedCommandArgument(3) );
}

// plugin price-server credit-pmt set <endpoint:1> <index:1> <valid:1>
//                      <providerId:4> <issuerEventId:4> <creditPaymentDueDate:4>
//                      <creditPaymentOverdueAmount:4> <creditPaymentStatus:1> <creditPayment:4> <creditPaymentDate:4>
//                      <creditPaymentRef:STRING>
void emAfPriceServerCliCreditPaymentSet(void)
{
  uint8_t len;
  uint8_t creditPaymentRef[21];
  len = emberCopyStringArgument(10, creditPaymentRef + 1, 20, false);
  creditPaymentRef[0] = len;
  emberAfPluginPriceServerCreditPaymentSet( (uint8_t) emberUnsignedCommandArgument(0),
                                            (uint8_t) emberUnsignedCommandArgument(1),
                                            (uint8_t) emberUnsignedCommandArgument(2),
                                            (uint32_t)emberUnsignedCommandArgument(3),
                                            (uint32_t)emberUnsignedCommandArgument(4),
                                            (uint32_t)emberUnsignedCommandArgument(5),
                                            (uint32_t)emberUnsignedCommandArgument(6),
                                            (uint8_t) emberUnsignedCommandArgument(7),
                                            (uint32_t)emberUnsignedCommandArgument(8),
                                            (uint32_t)emberUnsignedCommandArgument(9),
                                            creditPaymentRef);
}

