espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/price-server/price-server-cli.c
// plugin price-server currency-conv pub <nodeId:2> <srcEndpoint:1> <dstEndpoint:1>
void emAfPriceServerCliCurrencyConversionPub(void)
{
  emberAfPluginPriceServerCurrencyConversionPub( (uint16_t)emberUnsignedCommandArgument(0),
                                                 (uint8_t)emberUnsignedCommandArgument(1),
                                                 (uint8_t)emberUnsignedCommandArgument(2) );
}

// plugin price-server currency-conv set <endpoint:1> <valid:1> <providerId:4> <issuerEventId:4> <startTime:4>
//                                       <oldCurrency:2> <newCurrency:2> <conversionFactor:4>
//                                       <conversionFactorTrailingDigit:1> <currencyChangeControlFlags:4>
void emAfPriceServerCliCurrencyConversionSet(void)
{
  emberAfPluginPriceServerCurrencyConversionSet( (uint8_t) emberUnsignedCommandArgument(0),
                                                 (uint8_t) emberUnsignedCommandArgument(1),
                                                 (uint32_t)emberUnsignedCommandArgument(2),
                                                 (uint32_t)emberUnsignedCommandArgument(3),
                                                 (uint32_t)emberUnsignedCommandArgument(4),
                                                 (uint16_t)emberUnsignedCommandArgument(5),
                                                 (uint16_t)emberUnsignedCommandArgument(6),
                                                 (uint32_t)emberUnsignedCommandArgument(7),
                                                 (uint8_t) emberUnsignedCommandArgument(8),
                                                 (uint32_t)emberUnsignedCommandArgument(9) );
}

// plugin price-server tariff-cancel set <endpoint:1> <valid:1> <providerId:4> <issuerTariffId:4> <tariffType:1>
void emAfPriceServerCliTariffCancellationSet(void)
{
  emberAfPluginPriceServerTariffCancellationSet( (uint8_t) emberUnsignedCommandArgument(0),
                                                 (uint8_t) emberUnsignedCommandArgument(1),
                                                 (uint32_t)emberUnsignedCommandArgument(2),
                                                 (uint32_t)emberUnsignedCommandArgument(3),
                                                 (uint8_t) emberUnsignedCommandArgument(4) );
}

// plugin price-server tariff-cancel pub <nodeId:2> <srcEndpoint:1> <dstEndpoint:1>
void emAfPriceServerCliTariffCancellationPub(void)
{
  emberAfPluginPriceServerTariffCancellationPub( (uint16_t)emberUnsignedCommandArgument(0),
                                                 (uint8_t)emberUnsignedCommandArgument(1),
                                                 (uint8_t)emberUnsignedCommandArgument(2) );
}
#else
// plugin price-server init <endpoint:1>
void emAfPriceServerCliInit(sl_cli_command_arg_t *arguments)
{
  emberAfPriceClusterServerInitCallback(sl_cli_get_argument_uint8(arguments, 0));
}

// plugin price-server clear <endpoint:1>
void emAfPriceServerCliClear(sl_cli_command_arg_t *arguments)
{
  emberAfPriceClearPriceTable(sl_cli_get_argument_uint8(arguments, 0));
}

// plugin price-server who <provId:4> <label:1-13> <eventId:4>
void emAfPriceServerCliWho(sl_cli_command_arg_t *arguments)
{
  uint8_t length;
  price.providerId = sl_cli_get_argument_uint32(arguments, 0);
  length = sl_zigbee_copy_string_arg(arguments, 1,
                                     price.rateLabel + 1,
                                     ZCL_PRICE_CLUSTER_MAXIMUM_RATE_LABEL_LENGTH,
                                     false);
  price.rateLabel[0] = length;
  price.issuerEventID = sl_cli_get_argument_uint32(arguments, 2);
}

// plugin price-server what <unitOfMeas:1> <curr:2> <ptd:1> <PTRT:1> <bt:1>
void emAfPriceServerCliWhat(sl_cli_command_arg_t *arguments)
{
  price.unitOfMeasure = sl_cli_get_argument_uint8(arguments, 0);
  price.currency = sl_cli_get_argument_uint16(arguments, 1);
  price.priceTrailingDigitAndTier = sl_cli_get_argument_uint8(arguments, 2);
  price.numberOfPriceTiersAndTier = sl_cli_get_argument_uint8(arguments, 3);
  price.numberOfBlockThresholds = sl_cli_get_argument_uint8(arguments, 4);
}

// plugin price-server when <startTime:4> <duration:2>
void emAfPriceServerCliWhen(sl_cli_command_arg_t *arguments)
{
  price.startTime = sl_cli_get_argument_uint32(arguments, 0);
  price.duration = sl_cli_get_argument_uint16(arguments, 1);
}

// plugin price-server price <price:4> <ratio:1> <genPrice:4> <genRatio:1>
void emAfPriceServerCliPrice(sl_cli_command_arg_t *arguments)
{
  price.price = sl_cli_get_argument_uint32(arguments, 0);
  price.priceRatio = sl_cli_get_argument_uint8(arguments, 1);
  price.generationPrice = sl_cli_get_argument_uint32(arguments, 2);
  price.generationPriceRatio = sl_cli_get_argument_uint8(arguments, 3);
}

// plugin price-server alternate <alternateCostDelivered:4> <alternateCostUnit:1> <alternateCostTrailingDigit:1>
void emAfPriceServerCliAlternate(sl_cli_command_arg_t *arguments)
{
  price.alternateCostDelivered = sl_cli_get_argument_uint32(arguments, 0);
  price.alternateCostUnit = sl_cli_get_argument_uint8(arguments, 1);
  price.alternateCostTrailingDigit = sl_cli_get_argument_uint8(arguments, 2);
}

// plugin price-server ack <req:1>
void emAfPriceServerCliAck(sl_cli_command_arg_t *arguments)
{
  price.priceControl &= ~ZCL_PRICE_CLUSTER_PRICE_ACKNOWLEDGEMENT_MASK;
  if ( (sl_cli_get_argument_uint8(arguments, 0)) == 1u) {
    price.priceControl |= EMBER_ZCL_PRICE_CONTROL_ACKNOWLEDGEMENT_REQUIRED;
  }
}

// plugin price-server <valid | invalid | tinvalid> <endpoint:1> <index:1>
void emAfPriceServerCliValid(sl_cli_command_arg_t *arguments)
{
  uint8_t endpoint = sl_cli_get_argument_uint8(arguments, 0);
  uint8_t index = sl_cli_get_argument_uint8(arguments, 1);
  uint8_t position = sl_cli_get_command_count(arguments) - 1;
  uint8_t command_first_character = sl_cli_get_command_string(arguments, position)[0];
  if (command_first_character == 't') {
    if (!emberAfPriceSetTariffTableEntry(endpoint,
                                         index,
                                         NULL,
                                         NULL)) {
      emberAfPriceClusterPrintln("tariff entry %d not present", index);
    }

    return;
  }

