espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/price-server/price-server-cli.c
  if (!emberAfPriceSetPriceTableEntry(endpoint,
                                      index,
                                      (command_first_character == 'v'
                                       ? &price
                                       : NULL))) {
    emberAfPriceClusterPrintln("price entry %d not present", index);
  }
}

// plugin price-server get <endpoint:1> <index:1>
void emAfPriceServerCliGet(sl_cli_command_arg_t *arguments)
{
  uint8_t endpoint = sl_cli_get_argument_uint8(arguments, 0);
  uint8_t index = sl_cli_get_argument_uint8(arguments, 1);
  if (!emberAfPriceGetPriceTableEntry(endpoint, index, &price)) {
    emberAfPriceClusterPrintln("price entry %d not present", index);
  }
}

// plugin price-server print <endpoint:1>
void emAfPriceServerCliPrint(sl_cli_command_arg_t *arguments)
{
  uint8_t endpoint = sl_cli_get_argument_uint8(arguments, 0);
  emberAfPricePrintPriceTable(endpoint);
}

// plugin price-server sprint
void emAfPriceServerCliSprint(sl_cli_command_arg_t *arguments)
{
  emberAfPricePrint(&price);
}

// plugin price-server publish <nodeId:2> <srcEndpoint:1> <dstEndpoint:1> <priceIndex:1>
void emAfPriceServerCliPublish(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerPublishPriceMessage((EmberNodeId)sl_cli_get_argument_uint16(arguments, 0),
                                              sl_cli_get_argument_uint8(arguments, 1),
                                              sl_cli_get_argument_uint8(arguments, 2),
                                              sl_cli_get_argument_uint8(arguments, 3));
}

// plugin price-server pub-tariff-info <nodeId:2> <srcEndpoint:1> <dstEndpoint:1> <tariffIndex:1>
void emAfPriceServerCliPubTariffInfo(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerPublishTariffMessage((EmberNodeId)sl_cli_get_argument_uint16(arguments, 0),
                                               sl_cli_get_argument_uint8(arguments, 1),
                                               sl_cli_get_argument_uint8(arguments, 2),
                                               sl_cli_get_argument_uint8(arguments, 3));
}

// plugin price-server block-period add <endpoint:1> <providerId:4> <issuerEventId:4> <blockPeriodStartTime:4> <blockPeriodDuration:4> <blockPeriodControl:1> <blockPeriodDurationType:1> <tariffType:1> <tariffResolutionPeriod:1>
void emAfPriceServerCliBlockPeriodAdd(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerBlockPeriodAdd(sl_cli_get_argument_uint8(arguments, 0),
                                         sl_cli_get_argument_uint32(arguments, 1),
                                         sl_cli_get_argument_uint32(arguments, 2),
                                         sl_cli_get_argument_uint32(arguments, 3),
                                         sl_cli_get_argument_uint32(arguments, 4),
                                         sl_cli_get_argument_uint8(arguments, 5),
                                         sl_cli_get_argument_uint8(arguments, 6),
                                         sl_cli_get_argument_uint32(arguments, 7),
                                         sl_cli_get_argument_uint32(arguments, 8),
                                         sl_cli_get_argument_uint8(arguments, 9),
                                         sl_cli_get_argument_uint8(arguments, 10) );
}

// plugin price-server block-period print <endpoint:1> <index:1>
void emAfPriceServerCliBlockPeriodPrint(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerBlockPeriodPrint(sl_cli_get_argument_uint8(arguments, 0),
                                           sl_cli_get_argument_uint8(arguments, 1) );
}

// plugin price-server block-period pub <nodeId:2> <srcEndpoint:1> <dstEndpoint:1> <index:1>
void emAfPriceServerCliBlockPeriodPub(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerBlockPeriodPub(sl_cli_get_argument_uint16(arguments, 0),
                                         sl_cli_get_argument_uint8(arguments, 1),
                                         sl_cli_get_argument_uint8(arguments, 2),
                                         sl_cli_get_argument_uint8(arguments, 3));
}

// plugin price-server block-period clear <endpoint:1>
void emAfPriceServerCliBlockPeriodClear(sl_cli_command_arg_t *arguments)
{
  emberAfPriceClearBlockPeriodTable(sl_cli_get_argument_uint8(arguments, 0));
}

// plugin price-server conversion-factor add <endpoint:1> <issuerEventId:4> <startTime:4> <conversionFactor:4> <conversionFactorTrailingDigit:1>
void emAfPriceServerCliConversionFactorAdd(sl_cli_command_arg_t *arguments)
{
  (void) emberAfPluginPriceServerConversionFactorAdd(sl_cli_get_argument_uint8(arguments, 0),
                                                     sl_cli_get_argument_uint32(arguments, 1),
                                                     sl_cli_get_argument_uint32(arguments, 2),
                                                     sl_cli_get_argument_uint32(arguments, 3),
                                                     sl_cli_get_argument_uint8(arguments, 4) );
}

// plugin price-server conversion-factor clear <endpoint:1>
void emAfPriceServerCliConversionFactorClear(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerConversionFactorClear(sl_cli_get_argument_uint8(arguments, 0) );
}

// plugin price-server conversion-factor pub <tableIndex:1>  <dst:2> <src endpoint:1>  <dst endpoint:1>
void emAfPriceServerCliConversionFactorPub(sl_cli_command_arg_t *arguments)
{
  uint8_t tableIndex = sl_cli_get_argument_uint8(arguments, 0);
  EmberNodeId dstAddr = (EmberNodeId)sl_cli_get_argument_uint16(arguments, 1);
  uint8_t srcEndpoint =  sl_cli_get_argument_uint8(arguments, 2);
  uint8_t dstEndpoint =  sl_cli_get_argument_uint8(arguments, 3);
  emberAfPluginPriceServerConversionFactorPub(tableIndex, dstAddr, srcEndpoint, dstEndpoint);
}

// plugin price-server conversion-factor print <endpoint:1>
void emAfPriceServerCliConversionFactorPrint(sl_cli_command_arg_t *arguments)
{
  emberAfPrintConversionTable(sl_cli_get_argument_uint8(arguments, 0) );
}

// plugin price-server calorific-value add <endpoint:1> <issuerEventId:4> <startTime:4> <calorificValue:4> <calorificValueUnit:1> <calorificValueTrailingDigit:1>
void emAfPriceServerCliCalorificValueAdd(sl_cli_command_arg_t *arguments)
{
  (void) emberAfPluginPriceServerCalorificValueAdd(sl_cli_get_argument_uint8(arguments, 0),
                                                   sl_cli_get_argument_uint32(arguments, 1),
                                                   sl_cli_get_argument_uint32(arguments, 2),
                                                   sl_cli_get_argument_uint32(arguments, 3),
                                                   sl_cli_get_argument_uint8(arguments, 4),
                                                   sl_cli_get_argument_uint8(arguments, 5));
}

// plugin price-server calorific-factor clear <endpoint:1>
void emAfPriceServerCliCalorificValueClear(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerCalorificValueClear(sl_cli_get_argument_uint8(arguments, 0) );
}

