espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/price-server/price-server-cli.c
// plugin price-server calorific-factor print <endpoint:1>
void emAfPriceServerCliCalorificValuePrint(sl_cli_command_arg_t *arguments)
{
  emberAfPrintCalorificValuesTable(sl_cli_get_argument_uint8(arguments, 0) );
}

// plugin price-server co2-val add <endpoint:1> <issuerEventId:4> <startTime:4> <providerId:4> <tariffType:1> <co2Value:4> <co2ValueUnit:1> <co2ValueTrailingDigit:1>
void emAfPriceServerCliCo2ValueAdd(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerCo2ValueAdd(sl_cli_get_argument_uint8(arguments, 0),
                                      sl_cli_get_argument_uint32(arguments, 1),
                                      sl_cli_get_argument_uint32(arguments, 2),
                                      sl_cli_get_argument_uint32(arguments, 3),
                                      sl_cli_get_argument_uint8(arguments, 4),
                                      sl_cli_get_argument_uint32(arguments, 5),
                                      sl_cli_get_argument_uint8(arguments, 6),
                                      sl_cli_get_argument_uint8(arguments, 7));
}

// plugin price-server co2-val clear <endpoint:1>
void emAfPriceServerCliCo2ValueClear(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerCo2ValueClear(sl_cli_get_argument_uint8(arguments, 0) );
}

// plugin price-server co2-val print <endpoint:1>
void emAfPriceServerCliCo2ValuePrint(sl_cli_command_arg_t *arguments)
{
  emberAfPrintCo2ValuesTable(sl_cli_get_argument_uint8(arguments, 0) );
}

// plugin price-server tier-label set
void emAfPriceServerCliTierLabelSet(sl_cli_command_arg_t *arguments)
{
  uint8_t len;
  uint8_t tierLabel[13];
  len = sl_zigbee_copy_string_arg(arguments, 7, tierLabel + 1, 12, false);

  tierLabel[0] = len;
  emberAfPluginPriceServerTierLabelSet(sl_cli_get_argument_uint8(arguments, 0),
                                       sl_cli_get_argument_uint8(arguments, 1),
                                       sl_cli_get_argument_uint8(arguments, 2),
                                       sl_cli_get_argument_uint32(arguments, 3),
                                       sl_cli_get_argument_uint32(arguments, 4),
                                       sl_cli_get_argument_uint32(arguments, 5),
                                       sl_cli_get_argument_uint8(arguments, 6),
                                       tierLabel);
}

// plugin price-server tier-label add-label
void emAfPriceServerCliTierLabelAddLabel(sl_cli_command_arg_t *arguments)
{
  uint8_t len;
  uint8_t tierLabel[13];
  uint32_t tariffId;
  len = sl_zigbee_copy_string_arg(arguments, 3, tierLabel + 1, 12, false);
  tierLabel[0] = len;

  tariffId = sl_cli_get_argument_uint32(arguments, 1);
  emberAfPluginPriceServerTierLabelAddLabel(sl_cli_get_argument_uint8(arguments, 0),
                                            tariffId,
                                            sl_cli_get_argument_uint8(arguments, 2),
                                            tierLabel);
}

// plugin price-server tier-label print <endpoint:1>
void emAfPriceServerCliTierLabelPrint(sl_cli_command_arg_t *arguments)
{
  emberAfPrintTierLabelsTable(sl_cli_get_argument_uint8(arguments, 0) );
}

// plugin price-server tier-label pub  <nodeId:2> <srcEndpoint:1> <dstEndpoint:1> <tableIndex:1>
void emAfPriceServerCliTierLabelPub(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerTierLabelPub(sl_cli_get_argument_uint16(arguments, 0),
                                       sl_cli_get_argument_uint8(arguments, 1),
                                       sl_cli_get_argument_uint8(arguments, 2),
                                       sl_cli_get_argument_uint8(arguments, 3));
}

// plugin price-server co2-val pub <nodeId:2> <srcEndpoint:1> <dstEndpoint:1> <tableIndex:1>
void emAfPriceServerCliCo2ValuePub(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerCo2LabelPub(sl_cli_get_argument_uint16(arguments, 0),
                                      sl_cli_get_argument_uint8(arguments, 1),
                                      sl_cli_get_argument_uint8(arguments, 2),
                                      sl_cli_get_argument_uint8(arguments, 3));
}

// plugin price-server billing-period add <endpoint:1> <startTime:4>
//                                        <issuerEventId:4> <providerId:4>
//                                        <providerId:4> <billingPeriodDuration:4>
//                                        <billingPeriodDuration:1> <tariffType:1>
void emAfPriceServerCliBillingPeriodAdd(sl_cli_command_arg_t *arguments)
{
  (void) emberAfPluginPriceServerBillingPeriodAdd(sl_cli_get_argument_uint8(arguments, 0),
                                                  sl_cli_get_argument_uint32(arguments, 1),
                                                  sl_cli_get_argument_uint32(arguments, 2),
                                                  sl_cli_get_argument_uint32(arguments, 3),
                                                  sl_cli_get_argument_uint32(arguments, 4),
                                                  sl_cli_get_argument_uint8(arguments, 5),
                                                  sl_cli_get_argument_uint8(arguments, 6));
}

// plugin price-server billing-period print <endpoint:1>
void emAfPriceServerCliBillingPeriodPrint(sl_cli_command_arg_t *arguments)
{
  emberAfPrintBillingPeriodTable(sl_cli_get_argument_uint8(arguments, 0) );
}

// plugin price-server billing-period pub
void emAfPriceServerCliBillingPeriodPub(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerBillingPeriodPub(sl_cli_get_argument_uint16(arguments, 0),
                                           sl_cli_get_argument_uint8(arguments, 1),
                                           sl_cli_get_argument_uint8(arguments, 2),
                                           sl_cli_get_argument_uint8(arguments, 3));
}

void emAfPriceServerCliBillingPeriodRepeat(sl_cli_command_arg_t *arguments)
{
  emAfPluginPriceServerBillingPeriodRepeat = (bool)sl_cli_get_argument_uint8(arguments, 0);
}

// plugin price-server consol-bill add  <endpoint:1> <startTime:4>
//                                      <issuerEventId:4> <providerId:4>
//                                      <billingPeriodDuration:4> <billingPeriodDurationType:1>
//                                      <tariffType:1> <consolidatedBill:4>
//                                      <currency:2> <billTrailingDigit:1>
void emAfPriceServerCliConsolidatedBillAdd(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerConsolidatedBillAdd(sl_cli_get_argument_uint8(arguments, 0),
                                              sl_cli_get_argument_uint32(arguments, 1),
                                              sl_cli_get_argument_uint32(arguments, 2),
                                              sl_cli_get_argument_uint32(arguments, 3),
                                              sl_cli_get_argument_uint32(arguments, 4),
                                              sl_cli_get_argument_uint8(arguments, 5),
                                              sl_cli_get_argument_uint8(arguments, 6),
                                              sl_cli_get_argument_uint32(arguments, 7),
                                              sl_cli_get_argument_uint16(arguments, 8),
                                              sl_cli_get_argument_uint8(arguments, 9) );
}

// plugin price-server consol-bill print <endpoint:1> <index:1>
void emAfPriceServerCliConsolidatedBillPrint(sl_cli_command_arg_t *arguments)
{
  emberAfPrintConsolidatedBillTableEntry(sl_cli_get_argument_uint32(arguments, 0),
                                         sl_cli_get_argument_uint32(arguments, 1) );
}

// plugin price-server consol-bill pub  <nodeId:2> <srcEp:1> <dstEp:1> <index:1>
void emAfPriceServerCliConsolidatedBillPub(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerConsolidatedBillPub(sl_cli_get_argument_uint16(arguments, 0),
                                              sl_cli_get_argument_uint8(arguments, 1),
                                              sl_cli_get_argument_uint8(arguments, 2),
                                              sl_cli_get_argument_uint8(arguments, 3));
}

// plugin price-server cpp-event set <endpoint:1> <valid:1> <providerId:4> <issuerEventId:4> <startTime:4>
//                                  <durationInMins:2> <tariffType:1> <cppPriceTier:1> <cppAuth:1>
void emAfPriceServerCliCppEventSet(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerCppEventSet(sl_cli_get_argument_uint8(arguments, 0),
                                      sl_cli_get_argument_uint8(arguments, 1),
                                      sl_cli_get_argument_uint32(arguments, 2),
                                      sl_cli_get_argument_uint32(arguments, 3),
                                      sl_cli_get_argument_uint32(arguments, 4),
                                      sl_cli_get_argument_uint16(arguments, 5),
                                      sl_cli_get_argument_uint8(arguments, 6),
                                      sl_cli_get_argument_uint8(arguments, 7),
                                      sl_cli_get_argument_uint8(arguments, 8));
}

// plugin price-server cpp-event pub <nodeId:2> <srcEndpoint:1> <dstEndpoint:1>
void emAfPriceServerCliCppEventPub(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerCppEventPub(sl_cli_get_argument_uint16(arguments, 0),
                                      sl_cli_get_argument_uint8(arguments, 1),
                                      sl_cli_get_argument_uint8(arguments, 2) );
}

// plugin price-server cpp-event print <endpoint:1>
void emAfPriceServerCliCppEventPrint(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerCppEventPrint(sl_cli_get_argument_uint8(arguments, 0) );
}

// plugin price-server credit-pmt pub <nodeId:2> <srcEndpoint:1> <dstEndpoint:1> <index:1>
void emAfPriceServerCliCreditPaymentPub(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerCreditPaymentPub(sl_cli_get_argument_uint16(arguments, 0),
                                           sl_cli_get_argument_uint8(arguments, 1),
                                           sl_cli_get_argument_uint8(arguments, 2),
                                           sl_cli_get_argument_uint8(arguments, 3));
}

// plugin price-server credit-pmt set <endpoint:1> <index:1> <valid:1>
//                      <providerId:4> <issuerEventId:4> <creditPaymentDueDate:4>
//                      <creditPaymentOverdueAmount:4> <creditPaymentStatus:1> <creditPayment:4> <creditPaymentDate:4>
//                      <creditPaymentRef:STRING>
void emAfPriceServerCliCreditPaymentSet(sl_cli_command_arg_t *arguments)
{
  uint8_t len;
  uint8_t creditPaymentRef[21];
  len = sl_zigbee_copy_string_arg(arguments, 10, creditPaymentRef + 1, 20, false);
  creditPaymentRef[0] = len;
  emberAfPluginPriceServerCreditPaymentSet(sl_cli_get_argument_uint8(arguments, 0),
                                           sl_cli_get_argument_uint8(arguments, 1),
                                           sl_cli_get_argument_uint8(arguments, 2),
                                           sl_cli_get_argument_uint32(arguments, 3),
                                           sl_cli_get_argument_uint32(arguments, 4),
                                           sl_cli_get_argument_uint32(arguments, 5),
                                           sl_cli_get_argument_uint32(arguments, 6),
                                           sl_cli_get_argument_uint8(arguments, 7),
                                           sl_cli_get_argument_uint32(arguments, 8),
                                           sl_cli_get_argument_uint32(arguments, 9),
                                           creditPaymentRef);
}

