espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/price-server/price-server-cli.c
// plugin price-server currency-conv pub <nodeId:2> <srcEndpoint:1> <dstEndpoint:1>
void emAfPriceServerCliCurrencyConversionPub(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerCurrencyConversionPub(sl_cli_get_argument_uint16(arguments, 0),
                                                sl_cli_get_argument_uint8(arguments, 1),
                                                sl_cli_get_argument_uint8(arguments, 2) );
}

// plugin price-server currency-conv set <endpoint:1> <valid:1> <providerId:4> <issuerEventId:4> <startTime:4>
//                                       <oldCurrency:2> <newCurrency:2> <conversionFactor:4>
//                                       <conversionFactorTrailingDigit:1> <currencyChangeControlFlags:4>
void emAfPriceServerCliCurrencyConversionSet(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerCurrencyConversionSet(sl_cli_get_argument_uint8(arguments, 0),
                                                sl_cli_get_argument_uint8(arguments, 1),
                                                sl_cli_get_argument_uint32(arguments, 2),
                                                sl_cli_get_argument_uint32(arguments, 3),
                                                sl_cli_get_argument_uint32(arguments, 4),
                                                sl_cli_get_argument_uint16(arguments, 5),
                                                sl_cli_get_argument_uint16(arguments, 6),
                                                sl_cli_get_argument_uint32(arguments, 7),
                                                sl_cli_get_argument_uint8(arguments, 8),
                                                sl_cli_get_argument_uint32(arguments, 9) );
}

// plugin price-server tariff-cancel set <endpoint:1> <valid:1> <providerId:4> <issuerTariffId:4> <tariffType:1>
void emAfPriceServerCliTariffCancellationSet(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerTariffCancellationSet(sl_cli_get_argument_uint8(arguments, 0),
                                                sl_cli_get_argument_uint8(arguments, 1),
                                                sl_cli_get_argument_uint32(arguments, 2),
                                                sl_cli_get_argument_uint32(arguments, 3),
                                                sl_cli_get_argument_uint8(arguments, 4));
}

// plugin price-server tariff-cancel pub <nodeId:2> <srcEndpoint:1> <dstEndpoint:1>
void emAfPriceServerCliTariffCancellationPub(sl_cli_command_arg_t *arguments)
{
  emberAfPluginPriceServerTariffCancellationPub(sl_cli_get_argument_uint16(arguments, 0),
                                                sl_cli_get_argument_uint8(arguments, 1),
                                                sl_cli_get_argument_uint8(arguments, 2) );
}
#endif //UC_BUILD
